
CREATE TABLE tabl (
  Numer INT NOT NULL,
  Cod INT NOT NULL,
  Newbie BOOL NOT NULL,
  Name VARCHAR(100) NOT NULL,
  Price NUMERIC DEFAULT NULL,
  Publishing VARCHAR(100) NOT NULL,
  Pages INT NOT NULL,
  Form VARCHAR(12) DEFAULT NULL,
  Date DATE DEFAULT NULL,
  Circulation INT NOT NULL,
  Topic VARCHAR(100) NOT NULL,
  Category VARCHAR(100) NOT NULL
);

-- Створення таблиці tabl
CREATE INDEX NewIndex ON tabl(Numer);

-- Внесення даних
INSERT INTO tabl (Numer, Cod, Newbie, Name, Price, Publishing, Pages, Form, Date, Circulation, Topic, Category) VALUES
(2, 5110, 'No', 'Апаратні засоби мультимедіа.Відеосистема PC', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Підручники'),
(8, 4985, 'No', 'Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид.', 18.90, 'Вільямс', 288, '70х100/16', '2000-07-07', 5000, 'Використання ПК в цілому', 'Підручники'),
(9, 5141, 'No', 'Структури даних та алгоритми', 37.80, 'Вільямс', 384, '70х100/16', '2000-09-29', 5000, 'Використання ПК в цілому', 'Підручники'),
(20, 5127, 'No', 'Автоматизація інженерно-графічних робіт', 11.58, 'Видавнича група BHV', 256, '70х100/16', '2000-06-15', 5000, 'Використання ПК в цілому', 'Підручники'),
(31, 5110, 'No', 'Апаратні засоби мультимедіа.Відеосистема PC', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(46, 5199, 'No', 'Залізо IBM 2001', 30.07, 'МикроАрт', 368, '70х100/16', '2000-02-12', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(50, 3851, 'No', 'Захист інформації та безпека комп"ютерних систем', 26.00, 'DiaSoft', 480, '84х108/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
(58, 3932, 'No', 'Як перетворити персональний комп"ютер на вимірювальний комплекс', 7.65, 'ДМК', 144, '60х88/16', '1999-09-26', 5000, 'Використання ПК в цілому', 'Інші книги'),
(59, 4713, 'No', 'Plug-ins. Додаткові програми для музичних програм', 11.41, 'ДМК', 144, '70х100/16', '2000-02-22', 5000, 'Використання ПК в цілому', 'Інші книги'),
(175, 5217, 'No', 'Windows ME. Найновіші версії програм', 16.57, 'Триумф', 320, '70х100/16', '2000-08-25', 5000, 'Операційні системи', 'Windows 2000'),
(176, 4829, 'No', 'Windows 2000 Professional крок за кроком з CD', 27.25, 'Эком', 320, '70х100/16', '2000-04-28', 5000, 'Операційні', 'Windows 2000'),
(188, 5170, 'No', 'Linux версії', 24.43, 'ДМК', 346, '70х100/16', '2000-09-29', 5000, 'Операційні', 'Linux'),
(191, 860, 'No', 'Операційна система UNIX', 3.50, 'Видавнича група BHV', 395, '84х100/16', '1997-05-05', 5000, 'Операційні', 'Unix'),
(203, 44, 'No', 'Відповіді на актуальні запитання щодо OS/2 Warp', 5.00, 'DiaSoft', 352, '60х84/16', '1996-03-20', 5000, 'Операційні', 'Інші операційні системи'),
(206, 5176, 'No', 'Windows ME. Супутник користувача', 12.76, 'Видавнича група BHV', 306, '', '2000-10-10', 5000, 'Операційні системи', 'Інші операційні системи'),
(209, 5462, 'No', 'Мова програмування С++. Лекції та вправи', 29.00, 'DiaSoft', 656, '84х108/16', '2000-12-12', 5000, 'Програмування', 'C&C++'),(210, 4982, 'No', 'Мова програмування С. Лекції та вправи', 29.00, 'DiaSoft', 432, '84х108/16', '2000-07-12', 5000, 'Програмування', 'C&C++'),
(220, 4687, 'No', 'Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів', 17.60, 'ДМК', 240, '70х100/16', '2000-02-03', 5000, 'Програмування', 'C&C++'),
(222, 235, 'No', 'Інформаційні системи і структури даних', NULL, 'Києво-Могилянська академія', 288, '60х90/16', NULL, 400, 'Використання ПК в цілому', 'Інші книги'),
(225, 8746, 'Yes', 'Бази даних в інформаційних системах', NULL, 'Університет "Україна"', 418, '60х84/16', '2018-07-25', 100, 'Програмування', 'SQL'),
(226, 2154, 'Yes', 'Сервер на основі операційної системи FreeBSD 6.1', 0, 'Університет "Україна"', 216, '60х84/16', '2015-11-03', 500, 'Програмування', 'Інші операційні системи'),
(245, 2662, 'No', 'Організація баз даних та знань', 0, 'Вінниця: ВДТУ', 208, '60х90/16', '2001-10-10', 1000, 'Програмування', 'SQL'),
(247, 5641, 'Yes', 'Організація баз даних та знань', 0, 'Видавнича група BHV', 384, '70х100/16', '2018-07-25', 5000, 'Програмування', 'SQL');

-- Додавання стовпця Author з типом VARCHAR(15)
ALTER TABLE tabl ADD COLUMN Author VARCHAR(15);

-- Зміна типу стовпця Author на VARCHAR(20)
ALTER TABLE tabl ALTER COLUMN Author TYPE VARCHAR(20);

-- Видалення стовпця Author
ALTER TABLE tabl DROP COLUMN Author;

-- Створення унікального індексу lab_lens на стовпці Numer у спадному порядку
CREATE UNIQUE INDEX lab_lens ON tabl (Numer DESC);

-- Видалення індексу lab_lens
DROP INDEX lab_lens;